app/Models/Cadastro/ProfissaoModel.php

SELECT `id`, `pro_descricao`
FROM `cad_profissao`
WHERE `cad_profissao`.`deleted_at` IS NULL
AND `cad_profissao`.`id` = 1
---
	public function returnSave(int $codigo = null)
	{
		return $this->select('id, pro_descricao')->find($codigo);