app/Models/Cadastro/TamanhoModel.php

    public function returnSave(int $codigo = null)
    {
        return $this->select('id, tam_descricao')->find($codigo);
---
SELECT `id`, `tam_descricao`
FROM `cad_tamanho`
WHERE `cad_tamanho`.`id` = 2

    public function arquivarRegistro(int $codigo = null)
    {
        if ($codigo != null) {
            $data['status'] = 9;
            return $this->update($codigo, $data);
---
UPDATE `cad_tamanho` SET `status` = 9, `updated_user_id` = NULL, `updated_at` = '2024-05-01 02:58'
WHERE `cad_tamanho`.`id` IN (2)