app/Controllers/Api/v1/Cadastro/Categorias.php

    public function findAll()
    {
        $return = $this->categoriaModel
            ->where('status', 1)
            ->orderBy('cat_descricao', 'asc')
            ->findAll();
---
SELECT *
FROM `cad_categoria`
WHERE `status` = 1
AND `cad_categoria`.`deleted_at` IS NULL
ORDER BY `cat_descricao` ASC