app/Controllers/Api/v1/Cadastro/Pessoas.php

    public function getCarregaTabela()
    {
        $response = array();

        $data['data'] = array();

        $result = $this->pessoaModel->whereIn('status', ['1', '2'])->withDeleted()->findAll();
---
SELECT *
FROM `cad_pessoa`
WHERE `status` IN ('1','2')

        }

        try {
            if ($this->pessoaModel->save($data)) {
---
INSERT INTO `cad_pessoa` (`pes_apelido`, `pes_celular`, `pes_cep`, `pes_cidade`, `pes_complemento`, `pes_email`, `pes_endereco`, `pes_estado`, `pes_tiponatureza`, `pes_nome`, `pes_setor`, `pes_numero`, `pes_telefone`, `tipo_cliente`, `profissao_id`, `status`, `pes_cpf`, `pes_datanascimento`, `pes_rg`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'F', 'TESTE', NULL, NULL, NULL, '1', '', '1', NULL, NULL, NULL)