app/Controllers/Api/v1/Cadastro/Tamanhos.php

SELECT *
FROM `cad_tamanho`
WHERE `status` IN ('1','2')
---
    public function getCarregaTabela($cod_tipo = 0)
    {
        $response['data'] = array();

        $result = $this->tamanhoModel
            ->where('tam_tipo', $cod_tipo)
            ->whereIn('status', ['1', '2'])
            ->withDeleted()
            ->findAll();

UPDATE `cad_tamanho` SET `tam_descricao` = 'METRO QUADRO', `tam_abreviacao` = 'M2', `tam_quantidade` = '1', `status` = '2', `updated_user_id` = NULL, `updated_at` = '2024-05-01 02:57'
WHERE `cad_tamanho`.`id` IN ('2')
---
    public function save()
    {
        if (!$this->request->isAJAX()) {
            return redirect()->back();
        }
        $data['tam_tipo'] = $this->request->getPost('cod_tipo');
        $data['tam_descricao'] = returnNull($this->request->getPost('cad_tamanho'), 'S');
        $data['tam_abreviacao'] = returnNull($this->request->getPost('cad_abreviacao'), 'S');
        $data['tam_quantidade'] = returnNull($this->request->getPost('cad_embalagem'), 'S');
        $data['status'] = $this->request->getPost('status');

        if (!empty($this->request->getPost('cod_tamanho'))) {
            $data['id'] = $this->request->getPost('cod_tamanho');

            $result = $this->buscaRegistro404($data['id']);
            $result->fill($data);

            if ($result->hasChanged() == false) {
                return $this->response->setJSON([
                    'status' => true,
                    'menssagem' => [
                        'status' => 'error',
                        'heading' => 'NÃO FOI POSSIVEL SALVAR O REGISTRO!',
                        'description' => "NÃO TEVE ALTERAÇÃO NO TAMANHO $result->cad_tamanho PARA SALVAR!"
                    ]
                ]);
            }
        }

        try {
            if ($this->tamanhoModel->save($data)) {

SELECT *
FROM `cad_tamanho`
WHERE `id` = '2'
AND `status` IN ('1','2')
 LIMIT 1
---
    public function show($paramentro)
    {
        $return = $this->tamanhoModel
            ->where('id', $paramentro)
            ->whereIn('status', ['1', '2'])
            ->first();

SELECT *
FROM `cad_tamanho`
WHERE `id` = '2'
AND `status` <> 0
AND `status` <> 3
 LIMIT 1
---
    public function arquivar($paramentro = null)
    {
        $categoria = $this->tamanhoModel->where('id', $paramentro)
            ->where('status <>', 0)
            ->where('status <>', 3)
            ->first();

SELECT *
FROM `cad_tamanho`
WHERE `cad_tamanho`.`id` = 2
---
    private function buscaRegistro404(int $codigo = null)
    {
        if (!$codigo || !$resultado = $this->tamanhoModel->withDeleted(true)->find($codigo)) {