app/Controllers/Api/v1/Financeiro/Subgrupo.php

    public function subgruposDespesas()
    {
        $return = $this->subgrupoModel
            ->getSubgrupoGrupoAtivo()
            ->where('cad_grupo.gru_tipo', 'D')
            ->orderBy('cad_subgrupo.sub_descricao', 'asc')
            ->findAll();
---
SELECT `cad_subgrupo`.*, `cad_grupo`.`gru_descricao`
FROM `cad_subgrupo`
JOIN `cad_grupo` ON `cad_grupo`.`id` = `cad_subgrupo`.`grupo_id`
WHERE `cad_grupo`.`status` = 1
AND `cad_subgrupo`.`status` = 1
AND `cad_grupo`.`gru_tipo` = 'D'
ORDER BY `cad_subgrupo`.`sub_descricao` ASC