app/Helpers/permissao_helper.php

SELECT *
FROM `con_empresa`
WHERE `id` = 1
 LIMIT 1
---
function dadosEmpresa(int $cod_empresa = 1)
{
    $EmpresaModel = new EmpresaModel();
    $empresa = $EmpresaModel->where('id', $cod_empresa)->first();